SELECT ACT-FILE ASSIGN TO 'ACCOUNT.DAT'                                         
             ORGANIZATION IS INDEXED                                            
             ACCESS MODE IS RANDOM                                              
             RECORD KEY IS ACT-NO                                               
             FILE STATUS IS WS-ACTSTAT.                                         
