SELECT TRAN-FILE ASSIGN TO 'TRANS.DAT'                                          
             ORGANIZATION IS INDEXED                                            
             ACCESS MODE IS SEQUENTIAL                                          
             RECORD KEY IS TRANS-NO                                             
             FILE STATUS IS WS-TRANSTAT.                                        
